In [2]:
import pandas as pd

In [4]:
pymoli_file = "./Resources/purchase_data.csv"
pymoli_file_df = pd.read_csv(pymoli_file, encoding="ISO-8859-1")

In [12]:
#count unique screen names. pull unique screen names and find the length. 
#https://www.geeksforgeeks.org/how-to-count-distinct-values-of-a-pandas-dataframe-column/ (about halfway down on site)
#create a data frame from above calculation (create dictionary to dataframe)
#classdemo (day 2? - creating data frames)

sn_count = len(pymoli_file_df["SN"].unique())
player_count_df = pd.DataFrame([{"Total Players": sn_count}])
player_count_df

   Total Players
0            576

In [13]:
#count unique items. pull unique items and find the lenght. 
#https://www.geeksforgeeks.org/how-to-count-distinct-values-of-a-pandas-dataframe-column/ (about halfway down on site)
number_unique_items = len(pymoli_file_df["Item Name"].unique())
num_purchases = pymoli_file_df["Price"].count()
sum_purchases = pymoli_file_df["Price"].sum()
avg_purchase_price = round(pymoli_file_df["Price"].sum()/pymoli_file_df["Price"].count())

#create a data frame from above calculations (create dictionary to dataframe)
#classdemo (day 2? - creating data frames)
purchase_analysis_df = pd.DataFrame(
                    [{"Number of Unique Items": number_unique_items, "Average Purchase Price": avg_purchase_price,
                      "Total Number of Purchases": num_purchases,"Total Revenue": sum_purchases}])
purchase_analysis_df

,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,179,3.0,780,2379.77

In [23]:
#remove duplicate rows of data
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop_duplicates.html
sn_gender_df = gender_df.drop_duplicates()
sn_gender_df

#gender counts (series)
#class demo (day 2 - UFO sightings)
sn_gender_series = sn_gender_df["Gender"].value_counts()
sn_gender_series

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [85]:
#not what i want to do for this
#this counts duplicate screen names
gender_counts = pymoli_file_df["Gender"].value_counts()
gender_counts_df = pd.DataFrame(gender_counts)
gender_counts_df

                       Gender
Male                      652
Female                    113
Other / Non-Disclosed      15

In [18]:
#create data frame with just screen name and gender
#classdemo (day 2 - good movies)
#need to get rid of duplicates
gender_df = pymoli_file_df[["SN", "Gender"]]
gender_df

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
775     Aethedru70  Female
776         Iral74    Male
777     Yathecal72    Male
778        Sisur91    Male
779      Ennrian78    Male

[780 rows x 2 columns]

In [19]:
#remove duplicate rows of data
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop_duplicates.html
sn_gender_df = gender_df.drop_duplicates()
sn_gender_df

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
773         Hala31    Male
774     Jiskjask80    Male
775     Aethedru70  Female
777     Yathecal72    Male
778        Sisur91    Male

[576 rows x 2 columns]

In [20]:
#gender counts (series)
#class demo (day 2 - UFO sightings)
sn_gender_series = sn_gender_df["Gender"].value_counts()
sn_gender_series

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [21]:
#group by gender
#class demo (day 2 - UFO sightings)
grouped_gender_df = sn_gender_df.groupby(["Gender"])
grouped_gender_df
grouped_gender_df.count().head(10)

                        SN
Gender
Female                  81
Male                   484
Other / Non-Disclosed   11

In [22]:
#group by gender
#class demo (day 2 - UFO sightings)
gender_demographics_df = pd.DataFrame({"Total Count": sn_gender_series, 
                                  "Percentage of Players": sn_gender_series/sn_count})
gender_demographics_df

                       Total Count  Percentage of Players
Male                           484               0.840278
Female                          81               0.140625
Other / Non-Disclosed           11               0.019097